xml-parsing/core/src/test/resources/req_cdata_embedded_small.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header/>
	<SOAP-ENV:Body>
		<ns3:A xmlns:ns3="urn:myNamespace">
			<B><![CDATA[<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<Message xmlns="http://www.myOther.org">
	<MyHeader>
		<C>test-mail@dummy.org</C>
	</MyHeader>
	<MyContent>
		<D>NachrichtBetreff</D>
		<E>
			<F>9002</F>
		</E>
		<Breakpoint>
			<Encoding>
				<F>9004</F>
				<Type>text/plain</Type>
			</Encoding>
			<Text>NachrichtText</Text>
		</Breakpoint>
		<MyContainer>
			<Data>TG9yZW0gaXBzdW0gZG9sb3Igc2l0IGFtZXQsIGNvbnNldGV0dXIgc2FkaXBzY2luZyBlbGl0ciwgc2VkIGRpYW0gbm9udW15IGVpcm1vZCB0ZW1wb3IgaW52aWR1bnQgdXQgbGFib3JlIGV0IGRvbG9yZSBtYWduYSBhbGlxdXlhbSBlcmF0LCBzZWQgZGlhbSB2b2x1cHR1YS4gQXQgdmVybyBlb3MgZXQgYWNjdXNhbSBldCBqdXN0byBkdW8</Data>
			<FileName>myFileName</FileName>
			<FileType>
				<F>95</F>
				<Type>txt</Type>
			</FileType>
		</MyContainer>
		<MyContainer>
			<Data>TG9yZW0gaXBzdW0gZG9sb3Igc2l0IGFtZXQsIGNvbnNldGV0dXIgc2FkaXBzY2luZyBlbGl0ciwgc2VkIGRpYW0gbm9udW15IGVpcm1vZCB0ZW1wb3IgaW52aWR1bnQgdXQgbGFib3JlIGV0IGRvbG9yZSBtYWduYSBhbGlxdXlhbSBlcmF0LCBzZWQgZGlhbSB2b2x1cHR1YS4gQXQgdmVybyBlb3MgZXQgYWNjdXNhbSBldCBqdXN0byBkdW8</Data>
			<FileName>FileName2</FileName>
			<FileType>
				<F>95</F>
				<Type>txt</Type>
			</FileType>
		</MyContainer>		
	</MyContent>
</Message>]]></B>
			<Z>
				<W>
					<F>9004</F>
					<Boing>text/plain</Boing>
				</W>
				<G>NachrichtText</G>
			</Z>
		</ns3:A>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
